logbook.org


#+TITLE:     RC Logbook
#+EXPORT_FILE_NAME: index.html
#+AUTHOR: RC Team
#+SETUPFILE: ./org-html-themes/org/theme-readtheorg.setup
#+OPTIONS:   H:4 num:nil toc:2

* RC Logbook

This file contains information on the current state of RC developments
and lists ideas, features, bugs and problems.

* Features and ideas
** Features in development

*** Archive expositions [ requisted ]

**** Ordering of portals by creation data / or alphabetic
*** Research Video Integration
** Features to be requested
*** TODO Picture tool should use tool defaut instead of intrensic size 
*** TODO Add "published by" to articles on the frontpage, published by JAR for example.
*** TODO Send email to NTNU admin when FEIDE student has logged in first time, creating a new account
*** TODO Media url's in text-based editor, not always translated to live url (https://www.researchcatalogue.net/text-editor/simple-media-resource?research=547070&simple-media=945677)
*** TODO Snapshot stored when admin changes revision state from "in revision" -> "in review"
*** TODO add trashcan button for comments on pages that can be seen by the commenter.

** Released features
*** Media Repository & API
*** add support for .art domains
*** Frontpage Redesign
*** SARA feed on front page
*** File size limit HTML import (raise to 10gb)
*** cms for about, terms and other static pages
*** feide login for ntnu bergen, nmh
*** terms of use simplification, checkbox online
*** css of profile page responsiveness
*** Make exposition version on submit 
*** Objects can now have a negative position but still be edited.
** Ideas
*** Reviewing menu
**** Order of items (add note should be first option)
**** Add-note keyboard shortcut
**** remove all notes action
*** Even stronger warning on self-publication. Inform user on DOI being created, and that this means that the reference is permanent.
*** Users to be member of only a portal and not of RC, so they cannot accidentily publish in RC portal.
*** view media set in exposition, also as replacement for slide show tool
*** dropbox mode (upload/add but not change) in media repo
*** Increase audio quality of zencoder (currently, uses pretty low bitrate, filters out everything above 15k)
*** Search through expositions
*** Undo button
*** Markdown in text/html tools
*** Text tools size warnings, current lack of limits stimulates risky designs.
*** Keywords: 
- Make keywords mandatory on publication
- Have a combination of closed and open vocabularies
*** versions visible for admins - for later reference/compare changes
*** exposition metadata export for journals
*** journal submission as application
*** application programs
save vs. submit, inform/warn people when deadline is close, message on save that this is not submitting
*** searchable inbox
*** object preview images without fixed width/height ratio. 
*** profile page
- better display of objects without image, "tumblr" page
- state share status clearly
- display abstract on/off setting
- show keywords
- tagging for profile organization / change group button for item
- collapse all groups
*** dates of expositions: 
- remove free "date" field. 
- add automatic creation date
- publication date will not be altered by unpublish/republished (only last modified)
*** editor role 
- can we allow this role without needing them to be portal admins
- list of objects of which they are editors
*** graphical editor
- pixel by pixel movement of tools with arrow keys (and pixel number display)
- linking to a tool instead of a position
- refresh overview when a tool was deleted
- alignment
- adjustments of margins for position links on the right side of the weave-some links currently 'bump' into borders, displaying the wrong position
- group selection (lasso / box selection)
- group locking (moving constallation)
- prototype tool/template
- copy-paste style tab settings
*** Archiving function
- this is an alternative form of publication where it is fixed, but only visible to portal admins. 
- probably needs some extra meta-data like department / context in which the archived exposition was produced.
