index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-14 Thu 11:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RC Logbook</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="RC Team" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">RC Logbook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4a8a17f">RC Logbook</a></li>
<li><a href="#org262a7a4">Features and ideas</a>
<ul>
<li><a href="#org6a316f0">Features in development</a></li>
<li><a href="#orga201ce4">Features to be requested</a></li>
<li><a href="#org3f74e9b">Released features</a></li>
<li><a href="#orgfdbc870">Ideas</a></li>
<li><a href="#orgc433ec2">Problems</a></li>
</ul>
</li>
<li><a href="#orgfcaa12f">Bugs</a>
<ul>
<li><a href="#org599e042">Bugs to be reported</a></li>
<li><a href="#orgc9bad13">Reported Bugs</a></li>
<li><a href="#org9894097">Fixed Bugs</a></li>
<li><a href="#orgb85de89">Releases</a></li>
</ul>
</li>
<li><a href="#org46cb4d3">Text Editor</a>
<ul>
<li><a href="#orge52943e">Fix issue with old expositions which have a missing "metadata" field in their json</a></li>
<li><a href="#org5ba6eb2">Parsing paragraphs can run into trouble if !{media} tag precedes it directly</a></li>
</ul>
</li>
<li><a href="#org247242e">Guide</a>
<ul>
<li><a href="#org9c499f6">Add a special section for reviewers/supervising</a></li>
<li><a href="#org778b3ea">Announcement Text</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4a8a17f" class="outline-2">
<h2 id="org4a8a17f">RC Logbook</h2>
<div class="outline-text-2" id="text-org4a8a17f">
<p>
This file contains information on the current state of RC developments
and lists ideas, features, bugs and problems.
</p>
</div>
</div>

<div id="outline-container-org262a7a4" class="outline-2">
<h2 id="org262a7a4">Features and ideas</h2>
<div class="outline-text-2" id="text-org262a7a4">
</div>
<div id="outline-container-org6a316f0" class="outline-3">
<h3 id="org6a316f0">Features in development</h3>
<div class="outline-text-3" id="text-org6a316f0">
</div>
<div id="outline-container-org82f3267" class="outline-4">
<h4 id="org82f3267">Archive expositions [ requisted ]</h4>
<div class="outline-text-4" id="text-org82f3267">
</div>
<div id="outline-container-orgbedd3c0" class="outline-5">
<h5 id="orgbedd3c0">Ordering of portals by creation data / or alphabetic</h5>
</div>
</div>
<div id="outline-container-org7cbc815" class="outline-4">
<h4 id="org7cbc815">Research Video Integration</h4>
</div>
</div>
<div id="outline-container-orga201ce4" class="outline-3">
<h3 id="orga201ce4">Features to be requested</h3>
<div class="outline-text-3" id="text-orga201ce4">
</div>
<div id="outline-container-org9941212" class="outline-4">
<h4 id="org9941212"><span class="todo TODO">TODO</span> Picture tool should use tool defaut instead of intrensic size</h4>
</div>
<div id="outline-container-org6f0bd2d" class="outline-4">
<h4 id="org6f0bd2d"><span class="todo TODO">TODO</span> Add "published by" to articles on the frontpage, published by JAR for example.</h4>
</div>
<div id="outline-container-orgdb6ece0" class="outline-4">
<h4 id="orgdb6ece0"><span class="todo TODO">TODO</span> Send email to NTNU admin when FEIDE student has logged in first time, creating a new account</h4>
</div>
<div id="outline-container-org679751a" class="outline-4">
<h4 id="org679751a"><span class="todo TODO">TODO</span> Media url's in text-based editor, not always translated to live url (<a href="https://www.researchcatalogue.net/text-editor/simple-media-resource?research=547070&amp;simple-media=945677">https://www.researchcatalogue.net/text-editor/simple-media-resource?research=547070&amp;simple-media=945677</a>)</h4>
</div>
<div id="outline-container-org3942a77" class="outline-4">
<h4 id="org3942a77"><span class="todo TODO">TODO</span> Snapshot stored when admin changes revision state from "in revision" -&gt; "in review"</h4>
</div>
<div id="outline-container-org262435b" class="outline-4">
<h4 id="org262435b"><span class="todo TODO">TODO</span> add trashcan button for comments on pages that can be seen by the commenter.</h4>
</div>
</div>

<div id="outline-container-org3f74e9b" class="outline-3">
<h3 id="org3f74e9b">Released features</h3>
<div class="outline-text-3" id="text-org3f74e9b">
</div>
<div id="outline-container-orgcc2f174" class="outline-4">
<h4 id="orgcc2f174">Media Repository &amp; API</h4>
</div>
<div id="outline-container-orgb1911ec" class="outline-4">
<h4 id="orgb1911ec">add support for .art domains</h4>
</div>
<div id="outline-container-orgd66bb28" class="outline-4">
<h4 id="orgd66bb28">Frontpage Redesign</h4>
</div>
<div id="outline-container-orgb1584fb" class="outline-4">
<h4 id="orgb1584fb">SARA feed on front page</h4>
</div>
<div id="outline-container-org176cf1e" class="outline-4">
<h4 id="org176cf1e">File size limit HTML import (raise to 10gb)</h4>
</div>
<div id="outline-container-org182b417" class="outline-4">
<h4 id="org182b417">cms for about, terms and other static pages</h4>
</div>
<div id="outline-container-orgcc224dc" class="outline-4">
<h4 id="orgcc224dc">feide login for ntnu bergen, nmh</h4>
</div>
<div id="outline-container-org89af3d2" class="outline-4">
<h4 id="org89af3d2">terms of use simplification, checkbox online</h4>
</div>
<div id="outline-container-orgfef7d40" class="outline-4">
<h4 id="orgfef7d40">css of profile page responsiveness</h4>
</div>
<div id="outline-container-org1b818ec" class="outline-4">
<h4 id="org1b818ec">Make exposition version on submit</h4>
</div>
<div id="outline-container-org4ad2947" class="outline-4">
<h4 id="org4ad2947">Objects can now have a negative position but still be edited.</h4>
</div>
</div>
<div id="outline-container-orgfdbc870" class="outline-3">
<h3 id="orgfdbc870">Ideas</h3>
<div class="outline-text-3" id="text-orgfdbc870">
</div>
<div id="outline-container-org39ce0c0" class="outline-4">
<h4 id="org39ce0c0">Reviewing menu</h4>
<div class="outline-text-4" id="text-org39ce0c0">
</div>
<div id="outline-container-org57b1212" class="outline-5">
<h5 id="org57b1212">Order of items (add note should be first option)</h5>
</div>
<div id="outline-container-orga808829" class="outline-5">
<h5 id="orga808829">Add-note keyboard shortcut</h5>
</div>
<div id="outline-container-org5bbf158" class="outline-5">
<h5 id="org5bbf158">remove all notes action</h5>
</div>
</div>
<div id="outline-container-org233198c" class="outline-4">
<h4 id="org233198c">Even stronger warning on self-publication. Inform user on DOI being created, and that this means that the reference is permanent.</h4>
</div>
<div id="outline-container-orgd68cf87" class="outline-4">
<h4 id="orgd68cf87">Users to be member of only a portal and not of RC, so they cannot accidentily publish in RC portal.</h4>
</div>
<div id="outline-container-orged8a991" class="outline-4">
<h4 id="orged8a991">view media set in exposition, also as replacement for slide show tool</h4>
</div>
<div id="outline-container-org8236fe2" class="outline-4">
<h4 id="org8236fe2">dropbox mode (upload/add but not change) in media repo</h4>
</div>
<div id="outline-container-org0ae11db" class="outline-4">
<h4 id="org0ae11db">Increase audio quality of zencoder (currently, uses pretty low bitrate, filters out everything above 15k)</h4>
</div>
<div id="outline-container-orgf5a10a6" class="outline-4">
<h4 id="orgf5a10a6">Search through expositions</h4>
</div>
<div id="outline-container-orgff5caca" class="outline-4">
<h4 id="orgff5caca">Undo button</h4>
</div>
<div id="outline-container-org649f4ac" class="outline-4">
<h4 id="org649f4ac">Markdown in text/html tools</h4>
</div>
<div id="outline-container-org2efe0f4" class="outline-4">
<h4 id="org2efe0f4">Text tools size warnings, current lack of limits stimulates risky designs.</h4>
</div>
<div id="outline-container-org6db2dbe" class="outline-4">
<h4 id="org6db2dbe">Keywords:</h4>
<div class="outline-text-4" id="text-org6db2dbe">
<ul class="org-ul">
<li>Make keywords mandatory on publication</li>
<li>Have a combination of closed and open vocabularies</li>
</ul>
</div>
</div>
<div id="outline-container-org7bc8983" class="outline-4">
<h4 id="org7bc8983">versions visible for admins - for later reference/compare changes</h4>
</div>
<div id="outline-container-org4db8249" class="outline-4">
<h4 id="org4db8249">exposition metadata export for journals</h4>
</div>
<div id="outline-container-org29bba09" class="outline-4">
<h4 id="org29bba09">journal submission as application</h4>
</div>
<div id="outline-container-orgcb7efbd" class="outline-4">
<h4 id="orgcb7efbd">application programs</h4>
<div class="outline-text-4" id="text-orgcb7efbd">
<p>
save vs. submit, inform/warn people when deadline is close, message on save that this is not submitting
</p>
</div>
</div>
<div id="outline-container-org05a86b0" class="outline-4">
<h4 id="org05a86b0">searchable inbox</h4>
</div>
<div id="outline-container-org8a4ddac" class="outline-4">
<h4 id="org8a4ddac">object preview images without fixed width/height ratio.</h4>
</div>
<div id="outline-container-orgc54e8b0" class="outline-4">
<h4 id="orgc54e8b0">profile page</h4>
<div class="outline-text-4" id="text-orgc54e8b0">
<ul class="org-ul">
<li>better display of objects without image, "tumblr" page</li>
<li>state share status clearly</li>
<li>display abstract on/off setting</li>
<li>show keywords</li>
<li>tagging for profile organization / change group button for item</li>
<li>collapse all groups</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0b18a0" class="outline-4">
<h4 id="orgb0b18a0">dates of expositions:</h4>
<div class="outline-text-4" id="text-orgb0b18a0">
<ul class="org-ul">
<li>remove free "date" field.</li>
<li>add automatic creation date</li>
<li>publication date will not be altered by unpublish/republished (only last modified)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc0b4f3" class="outline-4">
<h4 id="orgcc0b4f3">editor role</h4>
<div class="outline-text-4" id="text-orgcc0b4f3">
<ul class="org-ul">
<li>can we allow this role without needing them to be portal admins</li>
<li>list of objects of which they are editors</li>
</ul>
</div>
</div>
<div id="outline-container-org0937e48" class="outline-4">
<h4 id="org0937e48">graphical editor</h4>
<div class="outline-text-4" id="text-org0937e48">
<ul class="org-ul">
<li>pixel by pixel movement of tools with arrow keys (and pixel number display)</li>
<li>linking to a tool instead of a position</li>
<li>refresh overview when a tool was deleted</li>
<li>alignment</li>
<li>adjustments of margins for position links on the right side of the weave-some links currently 'bump' into borders, displaying the wrong position</li>
<li>group selection (lasso / box selection)</li>
<li>group locking (moving constallation)</li>
<li>prototype tool/template</li>
<li>copy-paste style tab settings</li>
</ul>
</div>
</div>
<div id="outline-container-orgb7c2f12" class="outline-4">
<h4 id="orgb7c2f12">Archiving function</h4>
<div class="outline-text-4" id="text-orgb7c2f12">
<ul class="org-ul">
<li>this is an alternative form of publication where it is fixed, but only visible to portal admins.</li>
<li>probably needs some extra meta-data like department / context in which the archived exposition was produced.</li>
</ul>
</div>
</div>
