logbook.org
*** Sortable list view of expositions on "Recent activity" "Recent publications", "My Profile" and other locations in RC.
*** elm text editor based on https://github.com/SidneyNemzer/elm-text-editor
*** comments/notes
**** footnote like comments {^1}
**** inline comments {<<>>}
**** {media} tag should be embedded in newlines for proper parsing of markdown paragraphs 
**** we need to rendered html version, one for public preview not displaying comments and one for editing (with comments)
*** footnotes
**** singled shared model for both editors
**** one list for the entire exposition
**** type of footnotes (references etc)
**** footnote edit page
**** reference counting, footnotes need to know where they are used
** Problems
*** Black bars in JWPlayer, which dynamically aplies "object-fit:contain" causing lots o problems. .jwplayer.jw-stretch-uniform video { object-fit: cover !important; } is a solution for now.XS
*** Line-height in HTML tool can cause issues (there is a tinymce css line that inherits it from parent, but this causes wrong size if there is styling inline the copied html). One solution could be to filter pasted html.
*** Unpublishing changes publication date when republished (for example 
*** Collaboration tab needs explanation text about what is what.         :UI:
*** Supervisor permissions behave weird on publication etc.
*** No quick way for supervisor to delete/manage all their notes.
*** Notes list
*** Private note
*** No duplicate names for expositions
*** Common user confusions:
- Adding a page, not showing up in Table of Contents
- Work / Exposition
- Video tool / Video embed
- PDF tool : Preview / PDF fields mixup
- Audio tool should not be an empty box, but communicate:
  "Audio tool: filename"
*** DONE Preview of text-based exposition does not update quickly enough
*** background color of text-based editor should not change when body background-color is set (connected to margin issue)
*** If a footnote reference is copied from one page to the next, the content of the footnote remains in the old page.
    
* Bugs
** Bugs to be reported
*** If an exposition is unpublished and then republished, it cannot be reviewed (reviewer sees an error when they try to view it)
*** Reviewers added by the reviewer button in Users will not always be added (if they are existing users)
*** Supervised expositions show up in two places: Research Exposition (collaborated) and Research Expositions.
*** Background on WORK page is styled incorrectly: https://www.researchcatalogue.net/profile/show-work?work=410001
*** Video playback in HTML expositions breaks down on mobile.
**** Controls do not work on mobile 
**** In Safari this may be caused by a bug in Safari itself: https://www.ctrl.blog/entry/safari-csp-media-controls.html
*** Word import in Graphical Editor doesn't use HTML default tool settings
*** Scrollbars hidden on Mac OS 
*** HTML tool show's page's background color (good), but even as the tool itself has another background color (bad).
*** change of font in CSS is not accepted after the publication of the exposition:  https://www.researchcatalogue.net/view/861875/861876
*** with pseudonyms the link to author's profile does not work
*** A published exposition in JAR does not appear in the public profile of one of the co-author
exposition: https://www.researchcatalogue.net/view/462390/462391
author: Mariella Greil-Moebius https://www.researchcatalogue.net/profile/?person=91218

*** When user hits a "auth required" they do not return to the same page
*** The SARA unsubscribe menu accessed from the link of the announcement does not work
** Reported Bugs
*** Full screen doesn't work with autoplay
*** metro js not loaded / Icons are not displayed
*** Published exposition cannot be connected to
*** Footnotes in copied expositions are not editable
** Fixed Bugs
*** DONE Fullscreen does not work in embedded videos. example 
https://www.researchcatalogue.net/editor?research=861875&weave=944937

*** DONE Login-as does not work for feide accounts
*** DONE position of tools can be made negative by mouse, but not edited by number in the style tab. (reporter: JAR, closed but not live)
*** DONE Fullscreen and Downloads on HTML-import videos (NTNU)
*** DONE (could not reproduce) Restoring an exposition while it was "in review", the "in review" status is inherited (SAR-1261)
*** DONE Footnotes -> dissapearing scrollbar problem when opening certain notes (SAR-1262)
*** DONE date of last change not updated for text-based expositions 
*** DONE exporting JAR expositions caused problems with Safari/Chrome (Aubiome project)
*** DONE Declining connection request does not have effect (reported)
