index.html
<div id="outline-container-org15eb853" class="outline-4">
<h4 id="org15eb853">Sortable list view of expositions on "Recent activity" "Recent publications", "My Profile" and other locations in RC.</h4>
</div>
<div id="outline-container-org6b349eb" class="outline-4">
<h4 id="org6b349eb">elm text editor based on <a href="https://github.com/SidneyNemzer/elm-text-editor">https://github.com/SidneyNemzer/elm-text-editor</a></h4>
</div>
<div id="outline-container-orgd0f4b8d" class="outline-4">
<h4 id="orgd0f4b8d">comments/notes</h4>
<div class="outline-text-4" id="text-orgd0f4b8d">
</div>
<div id="outline-container-org204664b" class="outline-5">
<h5 id="org204664b">footnote like comments {<sup>1</sup>}</h5>
</div>
<div id="outline-container-orgd4d49e6" class="outline-5">
<h5 id="orgd4d49e6">inline comments {&lt;&lt;&gt;&gt;}</h5>
</div>
<div id="outline-container-orga493071" class="outline-5">
<h5 id="orga493071">{media} tag should be embedded in newlines for proper parsing of markdown paragraphs</h5>
</div>
<div id="outline-container-org4e3962a" class="outline-5">
<h5 id="org4e3962a">we need to rendered html version, one for public preview not displaying comments and one for editing (with comments)</h5>
</div>
</div>
<div id="outline-container-org9331ed3" class="outline-4">
<h4 id="org9331ed3">footnotes</h4>
<div class="outline-text-4" id="text-org9331ed3">
</div>
<div id="outline-container-orge7c9ccd" class="outline-5">
<h5 id="orge7c9ccd">singled shared model for both editors</h5>
</div>
<div id="outline-container-org466d5ae" class="outline-5">
<h5 id="org466d5ae">one list for the entire exposition</h5>
</div>
<div id="outline-container-org51f0aae" class="outline-5">
<h5 id="org51f0aae">type of footnotes (references etc)</h5>
</div>
<div id="outline-container-org44ef153" class="outline-5">
<h5 id="org44ef153">footnote edit page</h5>
</div>
<div id="outline-container-org0ade2b6" class="outline-5">
<h5 id="org0ade2b6">reference counting, footnotes need to know where they are used</h5>
</div>
</div>
</div>
<div id="outline-container-orgc433ec2" class="outline-3">
<h3 id="orgc433ec2">Problems</h3>
<div class="outline-text-3" id="text-orgc433ec2">
</div>
<div id="outline-container-org9d5c6a1" class="outline-4">
<h4 id="org9d5c6a1">Black bars in JWPlayer, which dynamically aplies "object-fit:contain" causing lots o problems. .jwplayer.jw-stretch-uniform video { object-fit: cover !important; } is a solution for now.XS</h4>
</div>
<div id="outline-container-org743318f" class="outline-4">
<h4 id="org743318f">Line-height in HTML tool can cause issues (there is a tinymce css line that inherits it from parent, but this causes wrong size if there is styling inline the copied html). One solution could be to filter pasted html.</h4>
</div>
<div id="outline-container-org8f071cc" class="outline-4">
<h4 id="org8f071cc">Unpublishing changes publication date when republished (for example</h4>
</div>
<div id="outline-container-orgd22995a" class="outline-4">
<h4 id="orgd22995a">Collaboration tab needs explanation text about what is what.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="UI">UI</span></span></h4>
</div>
<div id="outline-container-org80a42fd" class="outline-4">
<h4 id="org80a42fd">Supervisor permissions behave weird on publication etc.</h4>
</div>
<div id="outline-container-orgb521384" class="outline-4">
<h4 id="orgb521384">No quick way for supervisor to delete/manage all their notes.</h4>
</div>
<div id="outline-container-orgfbf7790" class="outline-4">
<h4 id="orgfbf7790">Notes list</h4>
</div>
<div id="outline-container-org1c2ef05" class="outline-4">
<h4 id="org1c2ef05">Private note</h4>
</div>
<div id="outline-container-org118efc9" class="outline-4">
<h4 id="org118efc9">No duplicate names for expositions</h4>
</div>
<div id="outline-container-orgbd8ff51" class="outline-4">
<h4 id="orgbd8ff51">Common user confusions:</h4>
<div class="outline-text-4" id="text-orgbd8ff51">
<ul class="org-ul">
<li>Adding a page, not showing up in Table of Contents</li>
<li>Work / Exposition</li>
<li>Video tool / Video embed</li>
<li>PDF tool : Preview / PDF fields mixup</li>
<li>Audio tool should not be an empty box, but communicate:
"Audio tool: filename"</li>
</ul>
</div>
</div>
<div id="outline-container-orgf417bc4" class="outline-4">
<h4 id="orgf417bc4"><span class="done DONE">DONE</span> Preview of text-based exposition does not update quickly enough</h4>
</div>
<div id="outline-container-org1db3ae1" class="outline-4">
<h4 id="org1db3ae1">background color of text-based editor should not change when body background-color is set (connected to margin issue)</h4>
</div>
<div id="outline-container-org00f56be" class="outline-4">
<h4 id="org00f56be">If a footnote reference is copied from one page to the next, the content of the footnote remains in the old page.</h4>
</div>
</div>
</div>

<div id="outline-container-orgfcaa12f" class="outline-2">
<h2 id="orgfcaa12f">Bugs</h2>
<div class="outline-text-2" id="text-orgfcaa12f">
</div>
<div id="outline-container-org599e042" class="outline-3">
<h3 id="org599e042">Bugs to be reported</h3>
<div class="outline-text-3" id="text-org599e042">
</div>
<div id="outline-container-org34a4630" class="outline-4">
<h4 id="org34a4630">If an exposition is unpublished and then republished, it cannot be reviewed (reviewer sees an error when they try to view it)</h4>
</div>
<div id="outline-container-org4a1cc76" class="outline-4">
<h4 id="org4a1cc76">Reviewers added by the reviewer button in Users will not always be added (if they are existing users)</h4>
</div>
<div id="outline-container-org24f926c" class="outline-4">
<h4 id="org24f926c">Supervised expositions show up in two places: Research Exposition (collaborated) and Research Expositions.</h4>
</div>
<div id="outline-container-org4df6c91" class="outline-4">
<h4 id="org4df6c91">Background on WORK page is styled incorrectly: <a href="https://www.researchcatalogue.net/profile/show-work?work=410001">https://www.researchcatalogue.net/profile/show-work?work=410001</a></h4>
</div>
<div id="outline-container-orgdaa665d" class="outline-4">
<h4 id="orgdaa665d">Video playback in HTML expositions breaks down on mobile.</h4>
<div class="outline-text-4" id="text-orgdaa665d">
</div>
<div id="outline-container-org6c3498e" class="outline-5">
<h5 id="org6c3498e">Controls do not work on mobile</h5>
</div>
<div id="outline-container-org15cfd3a" class="outline-5">
<h5 id="org15cfd3a">In Safari this may be caused by a bug in Safari itself: <a href="https://www.ctrl.blog/entry/safari-csp-media-controls.html">https://www.ctrl.blog/entry/safari-csp-media-controls.html</a></h5>
</div>
</div>
<div id="outline-container-org4c398a7" class="outline-4">
<h4 id="org4c398a7">Word import in Graphical Editor doesn't use HTML default tool settings</h4>
</div>
<div id="outline-container-org68cb9a7" class="outline-4">
<h4 id="org68cb9a7">Scrollbars hidden on Mac OS</h4>
</div>
<div id="outline-container-org55321b2" class="outline-4">
<h4 id="org55321b2">HTML tool show's page's background color (good), but even as the tool itself has another background color (bad).</h4>
</div>
<div id="outline-container-orge9a59f7" class="outline-4">
<h4 id="orge9a59f7">change of font in CSS is not accepted after the publication of the exposition:  <a href="https://www.researchcatalogue.net/view/861875/861876">https://www.researchcatalogue.net/view/861875/861876</a></h4>
</div>
<div id="outline-container-org13971aa" class="outline-4">
<h4 id="org13971aa">with pseudonyms the link to author's profile does not work</h4>
</div>
<div id="outline-container-org1928f59" class="outline-4">
<h4 id="org1928f59">A published exposition in JAR does not appear in the public profile of one of the co-author</h4>
<div class="outline-text-4" id="text-org1928f59">
<p>
exposition: <a href="https://www.researchcatalogue.net/view/462390/462391">https://www.researchcatalogue.net/view/462390/462391</a>
author: Mariella Greil-Moebius <a href="https://www.researchcatalogue.net/profile/?person=91218">https://www.researchcatalogue.net/profile/?person=91218</a>
</p>
</div>
</div>

<div id="outline-container-orgb9fb6f5" class="outline-4">
<h4 id="orgb9fb6f5">When user hits a "auth required" they do not return to the same page</h4>
</div>
<div id="outline-container-orgad1c805" class="outline-4">
<h4 id="orgad1c805">The SARA unsubscribe menu accessed from the link of the announcement does not work</h4>
</div>
</div>
<div id="outline-container-orgc9bad13" class="outline-3">
<h3 id="orgc9bad13">Reported Bugs</h3>
<div class="outline-text-3" id="text-orgc9bad13">
</div>
<div id="outline-container-orgcb09b07" class="outline-4">
<h4 id="orgcb09b07">Full screen doesn't work with autoplay</h4>
</div>
<div id="outline-container-orgb2cffbf" class="outline-4">
<h4 id="orgb2cffbf">metro js not loaded / Icons are not displayed</h4>
</div>
<div id="outline-container-orgf460829" class="outline-4">
<h4 id="orgf460829">Published exposition cannot be connected to</h4>
</div>
<div id="outline-container-orgc392755" class="outline-4">
<h4 id="orgc392755">Footnotes in copied expositions are not editable</h4>
</div>
</div>
<div id="outline-container-org9894097" class="outline-3">
<h3 id="org9894097">Fixed Bugs</h3>
<div class="outline-text-3" id="text-org9894097">
</div>
<div id="outline-container-orga8a9c88" class="outline-4">
<h4 id="orga8a9c88"><span class="done DONE">DONE</span> Fullscreen does not work in embedded videos. example</h4>
<div class="outline-text-4" id="text-orga8a9c88">
<p>
<a href="https://www.researchcatalogue.net/editor?research=861875&amp;weave=944937">https://www.researchcatalogue.net/editor?research=861875&amp;weave=944937</a>
</p>
</div>
</div>

<div id="outline-container-org93abbd0" class="outline-4">
<h4 id="org93abbd0"><span class="done DONE">DONE</span> Login-as does not work for feide accounts</h4>
</div>
<div id="outline-container-org6764dc4" class="outline-4">
<h4 id="org6764dc4"><span class="done DONE">DONE</span> position of tools can be made negative by mouse, but not edited by number in the style tab. (reporter: JAR, closed but not live)</h4>
</div>
<div id="outline-container-org030e3a6" class="outline-4">
<h4 id="org030e3a6"><span class="done DONE">DONE</span> Fullscreen and Downloads on HTML-import videos (NTNU)</h4>
</div>
<div id="outline-container-orgcad316d" class="outline-4">
<h4 id="orgcad316d"><span class="done DONE">DONE</span> (could not reproduce) Restoring an exposition while it was "in review", the "in review" status is inherited (SAR-1261)</h4>
</div>
<div id="outline-container-orgb917e9c" class="outline-4">
<h4 id="orgb917e9c"><span class="done DONE">DONE</span> Footnotes -&gt; dissapearing scrollbar problem when opening certain notes (SAR-1262)</h4>
</div>
<div id="outline-container-orgad56826" class="outline-4">
<h4 id="orgad56826"><span class="done DONE">DONE</span> date of last change not updated for text-based expositions</h4>
</div>
<div id="outline-container-org6d16498" class="outline-4">
<h4 id="org6d16498"><span class="done DONE">DONE</span> exporting JAR expositions caused problems with Safari/Chrome (Aubiome project)</h4>
</div>
<div id="outline-container-orgc37e201" class="outline-4">
<h4 id="orgc37e201"><span class="done DONE">DONE</span> Declining connection request does not have effect (reported)</h4>
</div>
