logbook.org
*** DONE Mail Link for owner with pseudonym on reviewing page (reported)
*** DONE restore deleted tools title column
*** DONE Exposition 849232 throws an error on preview

*** DONE Video player does not respond if autoplay is blocked.
*** DONE Issue name is missing from research page. (also ordering is arbitrary, should either be customizable or make sense) (reporter: NMH)

** Releases
*** <2019-12-14 Sat> Text-based editor version 2.1.1

* Text Editor
** Fix issue with old expositions which have a missing "metadata" field in their json
** Parsing paragraphs can run into trouble if !{media} tag precedes it directly

* Guide

** Add a special section for reviewers/supervising
*** How to use notes
*** How to find an exposition
*** How to accept invitations / what does "deprecated" mean
*** How to remove notes
*** Missing pagesc
** Announcement Text
New RC Feature: Media Repository

We are happy to announce the upcoming release of a new RC feature. The
new media repository allows RC users to navigate, organize and manage
all of their media. Each user can browse and search the media that is
used in their expositions or collect media files and texts with which
to create an exposition later. The media repository facilitates
metadata editing, sharing, categorizing data, note taking, personal
and collective storage. It is the first use of the new media API,
which will enable the RC to be linked to external repositories as
well. The repository is fully responsive and will work on mobile
devices.

You can find more information and documentation here: 
https://guide.researchcatalogue.net/#media-repository

