index.html
<div id="outline-container-org048376f" class="outline-4">
<h4 id="org048376f"><span class="done DONE">DONE</span> Mail Link for owner with pseudonym on reviewing page (reported)</h4>
</div>
<div id="outline-container-orga2cbe77" class="outline-4">
<h4 id="orga2cbe77"><span class="done DONE">DONE</span> restore deleted tools title column</h4>
</div>
<div id="outline-container-org6d9aef0" class="outline-4">
<h4 id="org6d9aef0"><span class="done DONE">DONE</span> Exposition 849232 throws an error on preview</h4>
</div>

<div id="outline-container-orgb9c2af5" class="outline-4">
<h4 id="orgb9c2af5"><span class="done DONE">DONE</span> Video player does not respond if autoplay is blocked.</h4>
</div>
<div id="outline-container-org40a33f3" class="outline-4">
<h4 id="org40a33f3"><span class="done DONE">DONE</span> Issue name is missing from research page. (also ordering is arbitrary, should either be customizable or make sense) (reporter: NMH)</h4>
</div>
</div>

<div id="outline-container-orgb85de89" class="outline-3">
<h3 id="orgb85de89">Releases</h3>
<div class="outline-text-3" id="text-orgb85de89">
</div>
<div id="outline-container-org2bf4411" class="outline-4">
<h4 id="org2bf4411"><span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-14 Sat&gt; </span></span> Text-based editor version 2.1.1</h4>
</div>
</div>
</div>

<div id="outline-container-org46cb4d3" class="outline-2">
<h2 id="org46cb4d3">Text Editor</h2>
<div class="outline-text-2" id="text-org46cb4d3">
</div>
<div id="outline-container-orge52943e" class="outline-3">
<h3 id="orge52943e">Fix issue with old expositions which have a missing "metadata" field in their json</h3>
</div>
<div id="outline-container-org5ba6eb2" class="outline-3">
<h3 id="org5ba6eb2">Parsing paragraphs can run into trouble if !{media} tag precedes it directly</h3>
</div>
</div>

<div id="outline-container-org247242e" class="outline-2">
<h2 id="org247242e">Guide</h2>
<div class="outline-text-2" id="text-org247242e">
</div>
<div id="outline-container-org9c499f6" class="outline-3">
<h3 id="org9c499f6">Add a special section for reviewers/supervising</h3>
<div class="outline-text-3" id="text-org9c499f6">
</div>
<div id="outline-container-org643ffee" class="outline-4">
<h4 id="org643ffee">How to use notes</h4>
</div>
<div id="outline-container-orgb7b5d93" class="outline-4">
<h4 id="orgb7b5d93">How to find an exposition</h4>
</div>
<div id="outline-container-org7c593dd" class="outline-4">
<h4 id="org7c593dd">How to accept invitations / what does "deprecated" mean</h4>
</div>
<div id="outline-container-org3beb95a" class="outline-4">
<h4 id="org3beb95a">How to remove notes</h4>
</div>
<div id="outline-container-org40c0853" class="outline-4">
<h4 id="org40c0853">Missing pagesc</h4>
</div>
</div>
<div id="outline-container-org778b3ea" class="outline-3">
<h3 id="org778b3ea">Announcement Text</h3>
<div class="outline-text-3" id="text-org778b3ea">
<p>
New RC Feature: Media Repository
</p>

<p>
We are happy to announce the upcoming release of a new RC feature. The
new media repository allows RC users to navigate, organize and manage
all of their media. Each user can browse and search the media that is
used in their expositions or collect media files and texts with which
to create an exposition later. The media repository facilitates
metadata editing, sharing, categorizing data, note taking, personal
and collective storage. It is the first use of the new media API,
which will enable the RC to be linked to external repositories as
well. The repository is fully responsive and will work on mobile
devices.
</p>

<p>
You can find more information and documentation here: 
<a href="https://guide.researchcatalogue.net/#media-repository">https://guide.researchcatalogue.net/#media-repository</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: RC Team</p>
<p class="date">Created: 2021-01-14 Thu 11:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
